In [29]:
import numpy as np 
import pandas as pd

In [30]:

data = {
    'name': [
        'nitish', 'ankit', 'rupesh', np.nan, 'mrityunjay',
        np.nan, 'rishabh', np.nan, 'aditya', np.nan
    ],
    'college': [
        'bit', 'iit', 'vit', np.nan, np.nan,
        'visi', 'ssit', np.nan, np.nan, 'git'
    ],
    'branch': [
        'eee', 'it', 'cse', np.nan, 'me',
        'ce', 'civil', 'cse', 'bio', np.nan
    ],
    'cgpa': [
        6.66, 8.25, 6.41, np.nan, 5.6,
        9.0, 7.4, 10.0, np.nan, np.nan
    ],
    'package': [
        4, 5, 6, np.nan, 6,
        7, 8, 9, np.nan, np.nan
    ]
}

student = pd.DataFrame(data)
student

         name college branch   cgpa  package
0      nitish     bit    eee   6.66      4.0
1       ankit     iit     it   8.25      5.0
2      rupesh     vit    cse   6.41      6.0
3         NaN     NaN    NaN    NaN      NaN
4  mrityunjay     NaN     me   5.60      6.0
5         NaN    visi     ce   9.00      7.0
6     rishabh    ssit  civil   7.40      8.0
7         NaN     NaN    cse  10.00      9.0
8      aditya     NaN    bio    NaN      NaN
9         NaN     git    NaN    NaN      NaN

# dropna --> series &  dataframe

In [31]:
student['name'].dropna()

0        nitish
1         ankit
2        rupesh
4    mrityunjay
6       rishabh
8        aditya
Name: name, dtype: object

In [32]:
student.dropna()

      name college branch  cgpa  package
0   nitish     bit    eee  6.66      4.0
1    ankit     iit     it  8.25      5.0
2   rupesh     vit    cse  6.41      6.0
6  rishabh    ssit  civil  7.40      8.0

In [33]:
# only if all data is nan 
student.dropna(how='all')

         name college branch   cgpa  package
0      nitish     bit    eee   6.66      4.0
1       ankit     iit     it   8.25      5.0
2      rupesh     vit    cse   6.41      6.0
4  mrityunjay     NaN     me   5.60      6.0
5         NaN    visi     ce   9.00      7.0
6     rishabh    ssit  civil   7.40      8.0
7         NaN     NaN    cse  10.00      9.0
8      aditya     NaN    bio    NaN      NaN
9         NaN     git    NaN    NaN      NaN

In [34]:
# only if we want to delate perticular row
student.dropna(subset=['name','cgpa'])

         name college branch  cgpa  package
0      nitish     bit    eee  6.66      4.0
1       ankit     iit     it  8.25      5.0
2      rupesh     vit    cse  6.41      6.0
4  mrityunjay     NaN     me  5.60      6.0
6     rishabh    ssit  civil  7.40      8.0

# fillna --> add value

In [35]:
student['name'].fillna('unknown')

0        nitish
1         ankit
2        rupesh
3       unknown
4    mrityunjay
5       unknown
6       rishabh
7       unknown
8        aditya
9       unknown
Name: name, dtype: object

In [36]:
student.fillna(0)

         name college branch   cgpa  package
0      nitish     bit    eee   6.66      4.0
1       ankit     iit     it   8.25      5.0
2      rupesh     vit    cse   6.41      6.0
3           0       0      0   0.00      0.0
4  mrityunjay       0     me   5.60      6.0
5           0    visi     ce   9.00      7.0
6     rishabh    ssit  civil   7.40      8.0
7           0       0    cse  10.00      9.0
8      aditya       0    bio   0.00      0.0
9           0     git      0   0.00      0.0

In [37]:
student['package'].fillna(student['package'].mean())

0    4.000000
1    5.000000
2    6.000000
3    6.428571
4    6.000000
5    7.000000
6    8.000000
7    9.000000
8    6.428571
9    6.428571
Name: package, dtype: float64

# forwardfill --> ffill & backwardfill --> bfill

In [38]:
student['name'].ffill()

0        nitish
1         ankit
2        rupesh
3        rupesh
4    mrityunjay
5    mrityunjay
6       rishabh
7       rishabh
8        aditya
9        aditya
Name: name, dtype: object

In [39]:
student['name'].bfill()

0        nitish
1         ankit
2        rupesh
3    mrityunjay
4    mrityunjay
5       rishabh
6       rishabh
7        aditya
8        aditya
9           NaN
Name: name, dtype: object

# drop_duplicate

In [40]:
tamp1 = pd.Series([1,2,3,1,2,3,1,2,3])
tamp1.drop_duplicates()

0    1
1    2
2    3
dtype: int64

In [41]:
data1 = {
    'name' : ['kaushik','kaushik','kajal','yash','dhara','sanjay'],
    'age' : [22,22,23,21,23,24],
    'dept' : ['IT','IT','HR',"IT",'HR','IT'],
    'cpmpany' : ['Google','Google','TCS','Google','TCS','Amazon'],


}

In [42]:
df = pd.DataFrame(data1)

In [43]:
df

      name  age dept cpmpany
0  kaushik   22   IT  Google
1  kaushik   22   IT  Google
2    kajal   23   HR     TCS
3     yash   21   IT  Google
4    dhara   23   HR     TCS
5   sanjay   24   IT  Amazon

In [44]:
df.drop_duplicates(keep='last')

      name  age dept cpmpany
1  kaushik   22   IT  Google
2    kajal   23   HR     TCS
3     yash   21   IT  Google
4    dhara   23   HR     TCS
5   sanjay   24   IT  Amazon

In [45]:
ipl = pd.read_csv('../8_files/ipl-matches.csv')

In [46]:
# find the last match played by virat kohli in delhi 
ipl.head(1)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon

In [47]:
ipl['all_player'] = ipl['Team1Players'] + ipl['Team2Players']

In [48]:
ipl.head(1)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,...,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2,all_player
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,...,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ..."

In [51]:
def chech_ply(player):
    return 'V Kohli' in player

In [53]:
ipl['play_kohli'] = ipl['all_player'].apply(chech_ply)

In [54]:
ipl.head(1)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,...,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2,all_player,play_kohli
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,...,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",False

In [66]:
ipl[(ipl['play_kohli'] == True) & (ipl['City'] == 'Delhi')].sort_values('Date',ascending=False).drop_duplicates(subset=['City','play_kohli'],keep='first')

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,...,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2,all_player,play_kohli
208,1178421,Delhi,2019-04-28,2019,46,Delhi Capitals,Royal Challengers Bangalore,Arun Jaitley Stadium,Delhi Capitals,bat,...,Runs,16.0,NaN,S Dhawan,"['PP Shaw', 'S Dhawan', 'SS Iyer', 'RR Pant', ...","['PA Patel', 'V Kohli', 'AB de Villiers', 'S D...",BNJ Oxenford,KN Ananthapadmanabhan,"['PP Shaw', 'S Dhawan', 'SS Iyer', 'RR Pant', ...",True

# drop

In [67]:
data = pd.Series([1,2,3,4,5,6])
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [72]:
data.drop(index=[0,5],inplace=True)

In [73]:
data

1    2
2    3
3    4
4    5
dtype: int64

In [74]:
student

         name college branch   cgpa  package
0      nitish     bit    eee   6.66      4.0
1       ankit     iit     it   8.25      5.0
2      rupesh     vit    cse   6.41      6.0
3         NaN     NaN    NaN    NaN      NaN
4  mrityunjay     NaN     me   5.60      6.0
5         NaN    visi     ce   9.00      7.0
6     rishabh    ssit  civil   7.40      8.0
7         NaN     NaN    cse  10.00      9.0
8      aditya     NaN    bio    NaN      NaN
9         NaN     git    NaN    NaN      NaN

In [78]:
student.drop(columns='branch')

         name college   cgpa  package
0      nitish     bit   6.66      4.0
1       ankit     iit   8.25      5.0
2      rupesh     vit   6.41      6.0
3         NaN     NaN    NaN      NaN
4  mrityunjay     NaN   5.60      6.0
5         NaN    visi   9.00      7.0
6     rishabh    ssit   7.40      8.0
7         NaN     NaN  10.00      9.0
8      aditya     NaN    NaN      NaN
9         NaN     git    NaN      NaN

In [79]:
student.drop(columns=['branch','cgpa'])

         name college  package
0      nitish     bit      4.0
1       ankit     iit      5.0
2      rupesh     vit      6.0
3         NaN     NaN      NaN
4  mrityunjay     NaN      6.0
5         NaN    visi      7.0
6     rishabh    ssit      8.0
7         NaN     NaN      9.0
8      aditya     NaN      NaN
9         NaN     git      NaN

In [84]:
student.drop(index=[0,9])
student.set_index('name',inplace=True)

In [85]:
student.drop(index=['nitish','aditya'])

           college branch   cgpa  package
name
ankit          iit     it   8.25      5.0
rupesh         vit    cse   6.41      6.0
NaN            NaN    NaN    NaN      NaN
mrityunjay     NaN     me   5.60      6.0
NaN           visi     ce   9.00      7.0
rishabh       ssit  civil   7.40      8.0
NaN            NaN    cse  10.00      9.0
NaN            git    NaN    NaN      NaN